Revit 2027 API
RouteAnalysisSettings.AnalysisZoneTopOffset Property
 The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AnalysisZoneTopOffset { get; set; }
Public Property AnalysisZoneTopOffset As Double
	Get
	Set
public:
property double AnalysisZoneTopOffset {
	double get ();
	void set (double value);
}
member AnalysisZoneTopOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for topOffset must be non-negative.
Remarks
 The zone's top plane elevation is different per plan view and is determined by adding the top offset to the view's level elevation.
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace